W7D4/CatRental/app/views/cats/show.html.erb

      <tbody>
        <% @cat.rental_requests.order('start_date').each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 2]]