W7D4/CatRental/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 7]]
---
        <!--  of default lazy load -->
        <% @cat.rental_requests.includes(:requester).order('start_date').each do |request| %>