W7D4/CatRental/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-01-15' OR end_date < '2020-01-09') AND "cat_rental_requests"."status" = $3  [["id", 2], ["cat_id", 1], ["status", "PENDING"]]
---
  def overlapping_pending_requests
    overlapping_requests.where(status: "PENDING")

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-04-17 23:09:57.490457"], ["id", 18]]
---
  def approve
    # This transaction means all or nothing, wont save anything if whole thing doesnt work.
    raise 'not pending' unless self.status == 'PENDING'

    if does_not_overlap_approved_request
      transaction do
          self.status = "APPROVED"
          self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-04-22 21:30:18.999200"], ["id", 27]]
---
  def deny!
    transaction do
      self.status = "DENIED"
      self.save!