W7D4/CatRental/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-04-14 01:05:48.580320"], ["id", 7]]
---
  def approve!
    # This transaction means all or nothing, wont save anything if whole thing doesnt work.
    transaction do
      if self.does_not_overlap_approved_request
        self.status = "APPROVED"
        self.save!

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-04-13 23:35:01.240938"], ["id", 6]]
---
  def deny!
    transaction do
      self.status = "DENIED"
      self.save!