W7D4/CatRental/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Fawn"], ["LIMIT", 1]]
---
  def self.find_by_credentials(user_name, password)
    user = User.find_by(user_name: user_name)