W7D4/CatRental/app/controllers/application_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_cat
    return nil unless params[:id]
    @current_cat ||= Cat.find(params[:id])