W7D4/CatRental/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2020-04-13"], ["end_date", "2020-04-17"], ["created_at", "2020-04-13 22:28:12.407588"], ["updated_at", "2020-04-13 22:28:12.407588"]]
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if @cat_rental_request.save!

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 9]]
---
  def current_cat_rental_request
    @cat_rental_request ||=
        CatRentalRequest.includes(:cat).find(params[:id])