W7D4/CatRental/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Freddy"], ["birth_date", "2020-04-24"], ["color", "White"], ["sex", "F"], ["created_at", "2020-04-12 18:57:05.461918"], ["updated_at", "2020-04-12 18:57:05.461918"]]

  def update
    @cat = Cat.find(params[:id])

    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Gonad"], ["sex", "M"], ["description", "Straight up G"], ["updated_at", "2020-04-12 22:44:27.765527"], ["id", 3]]