W9D1/CatRental/app/models/user.rb

SELECT  1 AS one FROM "cats" WHERE "cats"."user_id" = $1 LIMIT $2  [["user_id", 8], ["LIMIT", 1]]
---
  def has_cats?
    # checks if cats array is empty or not to determine
     !self.cats.empty?

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Janet"], ["LIMIT", 1]]
---
  def self.find_by_credentials(user_name, password)
    user = User.find_by(user_name: user_name)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "rrqDWPViKTW_mQ7dKz4iaQ"], ["updated_at", "2020-04-27 20:20:09.299133"], ["id", 1]]
---
  def reset_session_token!
    # Resets our session token and outputs it so we can pass it to our
    #  session[:session_token] when creating a new session on login.
    self.session_token = User.generate_session_token
    self.save!