W7D4/CatRental/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
        <option value="none">--Select Cat--</option>
        <% Cat.all.each do |cat| %>