W6D3/CatAPI/app/views/cats/show.html.erb

<ul>
    <% @cat.toys.each do |toy| %>
---
SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = $1  [["cat_id", 2]]