W6D3-CatAPI/CatAPI/app/controllers/cats_controller.rb

  def index
    # GET /cats
    # cats = Cat.all #pull all cats
    # render json: cats #Return in a json format
    #Above made into one line

    #Set and instance variable to access this data from a request in teh view, without @ it would be
    # local variable and not be available in the view
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    # GET /cats/:id
    # cats = Cat.find(params[:id])
    # render json: cats
    # render json: Cat.find(params[:id])
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # POST /cats - create a new cat
    # Content-length: ...
    #
    # {body injson format} = {"cat": {"name": "Sally"}, "dog": { "name": "Bertrand"} }

    @cat = Cat.new(cat_params)

    # NOTE REDIRECT_TO USAGE HERE!
    if @cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Spolombo"], ["created_at", "2020-04-03 16:12:01.876877"], ["updated_at", "2020-04-03 16:12:01.876877"], ["skill", "Chillin"]]

  def edit
    #show a form to edit an existing cat
    # @/cats/:id/edit

    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
    # ...
    #Cant shouldnt eb able to update self to become admin...
    @cat = Cat.find(params[:id])
    # if i upload an admin attribute, this tries to set
    # cat.admin, but i dont want this

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Gilbertson"], ["updated_at", "2020-04-03 17:32:05.443195"], ["id", 28]]

  def destroy
    # ...
    # if !curren_cst_user.admin
    #     raise "error"
    # end

    @cat = Cat.find(params[:id])
    @cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 25]]