W6D5/UserAPI/app/controllers/artwork_shares_controller.rb

  def create
    #POST /artwork_shares
    # create a new share, between a viewer and an artwork
    artwork_share = ArtworkShare.new(params.require(:artwork_share).permit(:user_id, :artwork_id))

    if artwork_share.save!
---
INSERT INTO "artwork_shares" ("user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 39], ["artwork_id", 26], ["created_at", "2020-04-06 21:48:41.698647"], ["updated_at", "2020-04-06 21:48:41.698647"]]

  def destroy
    # DELETE /artwork_shares/:id
    #unshares an artwork from a viewer
    artwork_share = ArtworkShare.find(params[:id])

    if artwork_share.destroy!
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 67], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 67]]

  def favorite
    # POST   /artwork_shares/:id/favorite(.:format)
    artwork_share = ArtworkShare.find(params[:id])
    artwork_share.favorite = true
    if artwork_share.save!
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2020-04-07 22:57:39.525372"], ["id", 42]]

  def unfavorite
    # POST   /artwork_shares/:id/unfavorite(.:format)
    artwork_share = ArtworkShare.find(params[:id])
    artwork_share.favorite = false
    if artwork_share.save!
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", false], ["updated_at", "2020-04-07 23:04:58.412139"], ["id", 42]]