W6D5/UserAPI/app/controllers/artworks_controller.rb

  def index
    #GET /artworks
    render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"