W6D5/UserAPI/app/controllers/artworks_controller.rb

  def create
    #post /artworks
    # as it doesnt authenticate that i am artist_id = x, anyone can upload as
    # that user just by passing their artist ID. Allowing somone to imposter
    artwork = Artwork.new(artwork_params)

    if artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cool Images"], ["image_url", "paintings.net/new"], ["artist_id", 40], ["created_at", "2020-04-06 21:11:25.938302"], ["updated_at", "2020-04-06 21:11:25.938302"]]

  def show
    #GET /artwork/:id
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def destroy
    #DELETE /artworks/:id
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def like
    like = Like.new(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Artwork")
    if like.save!
---
INSERT INTO "likes" ("user_id", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 40], ["imageable_type", "Artwork"], ["imageable_id", 35], ["created_at", "2020-04-07 21:03:32.018096"], ["updated_at", "2020-04-07 21:03:32.018096"]]

  def unlike
    like = Like.find_by(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Artwork")

    if like.destroy!
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."imageable_id" = $2 AND "likes"."imageable_type" = $3 LIMIT $4  [["user_id", 40], ["imageable_id", 38], ["imageable_type", "Artwork"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 3]]

  def favorite
    # POST   /artworks/:id/favorite(.:format)
    artwork = Artwork.find(params[:id])
    artwork.favorite = true
    if artwork.save!
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2020-04-07 23:00:06.075859"], ["id", 29]]

  def unfavorite
    # POST   /artworks/:id/unfavorite(.:format)
    artwork = Artwork.find(params[:id])
    artwork.favorite = false
    if artwork.save!
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2020-04-07 23:03:32.667537"], ["id", 29]]