W6D5/UserAPI/app/controllers/comments_controller.rb

  def index
    # called through GET    /artworks/:artwork_id/comments(.:format)
    # OR GET    /users/:user_id/comments(.:format)
    # filter vbasded on where tis coming from and retrurn correct list of comments

    if params[:user_id]
      render json: User.find(params[:user_id]).comments
    elsif params[:artwork_id]
      render json: Artwork.find(params[:artwork_id]).comments
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 40]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 31]]

  def create
    # POST /comments(.:format)
    comment = Comment.new(comment_params)

    if comment.save!
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 39], ["artwork_id", 26], ["body", "Whoah we have some comments!"], ["created_at", "2020-04-07 00:59:22.504343"], ["updated_at", "2020-04-07 00:59:22.504343"]]

  def destroy
    #  DELETE /comments/:id(.:format)
    comment = Comment.find(params[:id])

    if comment.destroy!
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]

  def like
    like = Like.new(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Comment")

    if like.save!
---
INSERT INTO "likes" ("user_id", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 38], ["imageable_type", "Comment"], ["imageable_id", 4], ["created_at", "2020-04-07 22:15:12.523642"], ["updated_at", "2020-04-07 22:15:12.523642"]]

  def unlike
    like = Like.find_by(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Comment")

    if like.destroy!
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."imageable_id" = $2 AND "likes"."imageable_type" = $3 LIMIT $4  [["user_id", 40], ["imageable_id", 1], ["imageable_type", "Comment"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]