W6D5/UserAPI/app/controllers/users_controller.rb

  def index
    # GET /users
    # returns our users in JSON format
    render json: User.all
---
SELECT "users".* FROM "users"

  def create
    # POST /users
    # We will create a new user with the submitted info

    user = User.new(user_params)

    if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bob"], ["email", "lame@email.ca"], ["created_at", "2020-04-04 00:10:18.262746"], ["updated_at", "2020-04-04 00:10:18.262746"]]

  def show
    # GET /users/:id
    #render json: params
    # could also render just :id with params[:id]

    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    # PATCH /users/:id
    # PUT /users/:id
    # Update contents of a user, allow editing of both name and email

    user = User.find(params[:id]) #Will auto catch if no user found

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Pickle Rick"], ["updated_at", "2020-04-06 19:06:47.209587"], ["id", 38]]

  def destroy
    # DELETE /users/:id
    # delte the given user, redirect to list of userrs pagfe if
    user = User.find(params[:id])

    if user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 45]]