W6D3/CatAPI/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "\"sally\""], ["created_at", "2020-04-02 19:31:26.714883"], ["updated_at", "2020-04-02 19:31:26.714883"]]
---
  def create
    # POST /cats - create a new cat
    # Content-length: ...
    #
    # {body injson format} = {"cat": {"name": "Sally"}, "dog": { "name": "Bertrand"} }
    cat = Cat.new(name: params[:cat])
    if cat.save