W6D3/CatAPI/app/controllers/toys_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    # /cats/:cat_id/toys
    cat = Cat.find(params[:cat_id])

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # /cats/:cat_id/toys/:id
    # prefer to ahve /toys/:id
    render json: Toy.find(params[:id])

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "toys" SET "name" = $1, "updated_at" = $2 WHERE "toys"."id" = $3  [["name", "Senetor_string"], ["updated_at", "2020-04-02 21:46:29.272485"], ["id", 5]]
---
  def update
    # /toys/:id
    toy = Toy.find(params[:id])

    if toy.update(params[:toy].permit(:name))

INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["name", "Mr. Yarn"], ["ttype", "string"], ["created_at", "2020-04-02 22:23:21.185574"], ["updated_at", "2020-04-02 22:23:21.185574"]]
---
  def create
    # POST /toys

    # params => Parameters < HashWIthIndiffferentAccess < Hash
    @toy = Toy.new(toy_params)
    @cat = @toy.cat

    if @toy.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @cat = Cat.find(params[:cat_id])