W7D3/LibraryDemo/app/controllers/books_controller.rb

  def index
    # GET /book
    @books = Book.all
---
SELECT  "books".* FROM "books" WHERE (500) LIMIT $1  [["LIMIT", 1]]

  def show
    # GET /book/:id
    @book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]