W6D5/ArtAPI/app/controllers/collections_controller.rb

  def index
    # GET    /users/:user_id/collections(.:format)
    # return all collections for given user
    render json: User.find(params[:user_id]).collections
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 1]]

  def create
    # POST   /collections(.:format)
    collection = Collection.new(collections_params)

    if collection.save!
---
INSERT INTO "collections" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cool Test COl"], ["user_id", 1], ["created_at", "2020-04-08 19:38:24.816886"], ["updated_at", "2020-04-08 19:38:24.816886"]]

  def show
    #  GET    /collections/:id(.:format)
    collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    # DELETE /collections/:id(.:format)
    collection = Collection.find(params[:id])
    if collection.destroy!
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 9]]

  def add_artwork
    artwork_collection = ArtworkCollection.new(artwork_id: params[:artwork_id], collection_id: params[:collection_id])

    if artwork_collection.save!
---
INSERT INTO "artwork_collections" ("artwork_id", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["collection_id", 9], ["created_at", "2020-04-08 19:48:13.048959"], ["updated_at", "2020-04-08 19:48:13.048959"]]

  def remove_artwork
    artwork_collection = ArtworkCollection.find_by(collection_id: params[:collection_id], artwork_id: params[:artwork_id])

    if artwork_collection.destroy!
---
SELECT  "artwork_collections".* FROM "artwork_collections" WHERE "artwork_collections"."collection_id" = $1 AND "artwork_collections"."artwork_id" = $2 LIMIT $3  [["collection_id", 9], ["artwork_id", 99], ["LIMIT", 1]]
DELETE FROM "artwork_collections" WHERE "artwork_collections"."id" = $1  [["id", 26]]