W6D5/ArtAPI/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 10]]
SELECT "comments".* FROM "comments"
---
  def index
    # called through GET    /artworks/:artwork_id/comments(.:format) - return art comments
    # OR GET    /users/:user_id/comments(.:format) - return suer comments
    # Or GET   /comments(.:format)  - return all
    # filter vbasded on where tis coming from and retrurn correct list of comments
    #NOTE!!!  does not grab from URL, must submit user_id or artwork_id as json param
    if params[:user_id]
      render json: User.find(params[:user_id]).comments
    elsif params[:artwork_id]
      render json: Artwork.find(params[:artwork_id]).comments
    else
      render json: Comment.all

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artwork_id", 2], ["body", "Super cool test comment"], ["created_at", "2020-04-08 18:52:20.030144"], ["updated_at", "2020-04-08 18:52:20.030144"]]
---
  def create
    # POST /comments(.:format)
    comment = Comment.new(comment_params)

    if comment.save!

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 16]]
---
  def destroy
    #  DELETE /comments/:id(.:format)
    comment = Comment.find(params[:id])

    if comment.destroy!

INSERT INTO "likes" ("user_id", "imageable_type", "imageable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["imageable_type", "Comment"], ["imageable_id", 16], ["created_at", "2020-04-08 18:55:18.948598"], ["updated_at", "2020-04-08 18:55:18.948598"]]
---
  def like
    # POST   /comments/:id/like
    like = Like.new(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Comment")

    if like.save!

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."imageable_id" = $2 AND "likes"."imageable_type" = $3 LIMIT $4  [["user_id", 2], ["imageable_id", 16], ["imageable_type", "Comment"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 16]]
---
  def unlike
    # POST   /comments/:id/unlike
    like = Like.find_by(user_id: params[:user_id], imageable_id: params[:id], imageable_type: "Comment")

    if like.destroy!