W7D3-Library/LibraryDemo/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE (500) LIMIT $1  [["LIMIT", 1]]
---
  def index
    # GET /book
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def show
    # GET /book/:id
    @book = Book.find_by(id: params[:id])

INSERT INTO "books" ("title", "author", "year", "category", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # Shouldnt pass in raw params data to model, filtrer through the book_params
    @book = Book.new(book_params) #This line creates a model level instance that we can then access from the pages we render, or gets us url redirects ect

    if @book.save!

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
---
  def edit
    @book = Book.find_by(id: params[:id] )

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "author" = $2, "year" = $3, "description" = $4, "updated_at" = $5 WHERE "books"."id" = $6
---
  def update
    @book = Book.find_by(id: params[:id])

    if @book.update_attributes(book_params)