W7D4/CatRentalSingleSession/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    # Once again here usintg the current_use instead of trusting the users
    # to not be malicious when entering in the user id for the rental
    # otherwise they may be able tro tamper and mak requests for others.
    @rental_request.user_id = current_user.id
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 24], ["start_date", "2020-04-26"], ["end_date", "2020-04-27"], ["created_at", "2020-04-22 23:09:41.227346"], ["updated_at", "2020-04-22 23:09:41.227346"], ["user_id", 2]]

  def current_cat_rental_request
    @rental_request ||=
        CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 24]]